; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 53386 1 3 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph1 - mode
	infrared2 - mode
	thermograph0 - mode
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Star4 - direction
	Star0 - direction
	Star2 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(have_image Star8 thermograph1)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 thermograph1)
	(have_image Star13 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 7
3. (turn_to satellite0 star8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star8)
   goals met: 0 of 7
4. (take_image satellite0 star8 instrument1 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 1 of 7
5. (turn_to satellite0 star13 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star13)
   goals met: 1 of 7
6. (take_image satellite0 star13 instrument1 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 2 of 7
7. (turn_to satellite0 star0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star0)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon12 instrument1 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 3 of 7
10. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 3 of 7
11. (turn_to satellite0 phenomenon10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 7
12. (take_image satellite0 phenomenon10 instrument1 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 4 of 7
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 7
14. (turn_to satellite0 star0 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star0)
   goals met: 4 of 7
15. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 7
16. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 4 of 7
17. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   goals met: 4 of 7
18. (take_image satellite0 planet9 instrument2 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 5 of 7
19. (turn_to satellite0 planet11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet11)
   goals met: 5 of 7
20. (take_image satellite0 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 6 of 7
21. (turn_to satellite0 groundstation7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation7)
   goals met: 7 of 7
